In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data[0] = None

In [4]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data0 =([1.,6.5,3.],[1.,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3.])

In [14]:
data0

([1.0, 6.5, 3.0], [1.0, nan, nan], [nan, nan, nan], [nan, 6.5, 3.0])

In [15]:
data = pd.DataFrame(data0)
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = np.nan

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(how ='all',axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -1.155322 -0.740404  0.602510
1 -0.569933 -1.204464  0.124631
2  0.006123 -0.495230  0.537359
3 -1.033495  1.420682  0.417924
4  0.849806  1.803444  0.696554
5  0.135219  1.960810 -1.562995
6  1.804918 -0.539179 -1.673533

In [21]:
df.iloc[:4,1] = np.nan

In [22]:
df

          0         1         2
0 -1.155322       NaN  0.602510
1 -0.569933       NaN  0.124631
2  0.006123       NaN  0.537359
3 -1.033495       NaN  0.417924
4  0.849806  1.803444  0.696554
5  0.135219  1.960810 -1.562995
6  1.804918 -0.539179 -1.673533

In [24]:
df.iloc[:2,2] = np.nan
df

          0         1         2
0 -1.155322       NaN       NaN
1 -0.569933       NaN       NaN
2  0.006123       NaN  0.537359
3 -1.033495       NaN  0.417924
4  0.849806  1.803444  0.696554
5  0.135219  1.960810 -1.562995
6  1.804918 -0.539179 -1.673533

In [25]:
df.dropna()

          0         1         2
4  0.849806  1.803444  0.696554
5  0.135219  1.960810 -1.562995
6  1.804918 -0.539179 -1.673533

In [26]:
df.dropna(thresh=2)

          0         1         2
2  0.006123       NaN  0.537359
3 -1.033495       NaN  0.417924
4  0.849806  1.803444  0.696554
5  0.135219  1.960810 -1.562995
6  1.804918 -0.539179 -1.673533

In [27]:
df.fillna(0)

          0         1         2
0 -1.155322  0.000000  0.000000
1 -0.569933  0.000000  0.000000
2  0.006123  0.000000  0.537359
3 -1.033495  0.000000  0.417924
4  0.849806  1.803444  0.696554
5  0.135219  1.960810 -1.562995
6  1.804918 -0.539179 -1.673533

In [29]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.155322  0.500000  0.000000
1 -0.569933  0.500000  0.000000
2  0.006123  0.500000  0.537359
3 -1.033495  0.500000  0.417924
4  0.849806  1.803444  0.696554
5  0.135219  1.960810 -1.562995
6  1.804918 -0.539179 -1.673533

In [31]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0  0.251887 -0.984318  0.874029
1 -1.271062  0.311545 -1.536197
2  1.279969  1.857275 -0.571191
3 -0.439418  0.206688 -0.260203
4 -0.178373 -0.219438  0.524730
5 -2.009587 -0.859274  0.875757

In [32]:
df.iloc[2:,1] = np.nan
df.iloc[4:,2] = np.nan

In [33]:
df

          0         1         2
0  0.251887 -0.984318  0.874029
1 -1.271062  0.311545 -1.536197
2  1.279969       NaN -0.571191
3 -0.439418       NaN -0.260203
4 -0.178373       NaN       NaN
5 -2.009587       NaN       NaN

In [34]:
df.fillna(method = 'ffill')

          0         1         2
0  0.251887 -0.984318  0.874029
1 -1.271062  0.311545 -1.536197
2  1.279969  0.311545 -0.571191
3 -0.439418  0.311545 -0.260203
4 -0.178373  0.311545 -0.260203
5 -2.009587  0.311545 -0.260203

In [35]:
df.fillna(method = 'ffill',limit = 2)

          0         1         2
0  0.251887 -0.984318  0.874029
1 -1.271062  0.311545 -1.536197
2  1.279969  0.311545 -0.571191
3 -0.439418  0.311545 -0.260203
4 -0.178373       NaN -0.260203
5 -2.009587       NaN -0.260203

In [36]:
data = pd.Series([1.,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [38]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data['v1'] = range(7)

In [43]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [45]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [46]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [47]:
data.drop_duplicates(subset = ['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [48]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]}
                   )
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [50]:
meat_to_animal = {'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'salmon'}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [51]:
lowercased = data['food'].str.lower()

In [52]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [53]:
data['animal'] = lowercased.map(meat_to_animal)

In [54]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [55]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [56]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),index = ['Ohio','Colordo','New York'],columns =['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colordo     4    5      6     7
New York    8    9     10    11

In [61]:
transform = lambda x:x[:4].upper()

In [58]:
transform

In [62]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [63]:
data.rename(index = str.title,columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colordo     4    5      6     7
New York    8    9     10    11

In [64]:
data.rename(index={'OHIO':'INDIANA'},columns = {'three':'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colordo     4    5         6     7
New York    8    9        10    11

In [69]:
ages = [20,22,25,27,21,23,37,31,31,61,45,41,32]
bins =[18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 13
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
cats.cate